# Test evaluation task suite for AI data designer

Setup API key to run tests below

In [12]:
import sys
import os

# Get the current working directory of the notebook
notebook_dir = os.getcwd()

# Define the root directory and add it to the path
root_dir = os.path.abspath(os.path.join(notebook_dir, '..', '..', '..'))
sys.path.insert(0, root_dir)

# set environment variable 'GRETEL_PROD_API_KEY' from https://console.gretel.ai/users/me/key
os.environ['GRETEL_PROD_API_KEY'] = 'GRETEL_PROD_API_KEY'

### Evaluate Synthetic Dataset

In [19]:
# Reload packages if you've made changes to the evaluation.py file.
# Alternatively you can restart the kernel to pick up changes

from importlib import reload
import evaluation
reload(evaluation)

import pandas as pd
from pprint import pprint
from navigator_helpers.llms.llm_suite import GretelLLMSuite
from evaluation import BaseEvaluationTaskSuite, NL2SQLEvaluationTaskSuite
from datasets import load_dataset

In [15]:
## TODO: add all datasets to test in a dictionary
dataset = load_dataset("gretelai/synthetic_text_to_sql", split="train")
dataset_1000 = dataset.select(range(1000))
dataset_1000_pd = dataset_1000.to_pandas()

In [16]:
llm_suite = GretelLLMSuite()

2024-10-08 18:20:29.317 - INFO - ü¶ú Initializing LLM suite
2024-10-08 18:20:29.319 - INFO - üìñ Natural language LLM: gretelai-mistral-nemo-2407
2024-10-08 18:20:29.320 - INFO - üíª Code LLM: gretelai-mistral-nemo-2407
2024-10-08 18:20:29.321 - INFO - ‚öñÔ∏è Judge LLM: gretelai-mistral-nemo-2407

In [20]:
results_1 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).row_uniqueness()
pprint(results_1)

{'non_semantically_unique_ids': [],
 'non_unique_ids': [],
 'percent_semantically_unique': 100.0,
 'percent_unique': 100.0}

In [22]:

results_2 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).feature_cardinality()
pprint(results_2)

{'domain': 0.6,
 'domain_description': 0.6,
 'id': 1.0,
 'sql': 1.0,
 'sql_complexity': 0.06,
 'sql_complexity_description': 0.06,
 'sql_context': 1.0,
 'sql_explanation': 1.0,
 'sql_prompt': 1.0,
 'sql_task_type': 0.04,
 'sql_task_type_description': 0.04}

In [23]:

results_3 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).feature_distribution()
pprint(results_3)

({'domain': {'agriculture': 1,
             'aquaculture': 1,
             'arts operations and management': 1,
             'automotive': 6,
             'beauty industry': 1,
             'biotechnology': 2,
             'chemicals': 2,
             'civil engineering': 1,
             'construction': 3,
             'cybersecurity': 3,
             'defense contractors': 1,
             'defense industry': 3,
             'defense operations': 4,
             'defense security': 3,
             'disability services': 1,
             'energy': 2,
             'entertainment industry': 1,
             'ethical fashion': 2,
             'finance': 1,
             'financial services': 1,
             'fine arts': 1,
             'food industry': 2,
             'forestry': 2,
             'gaming technology': 1,
             'government policy': 1,
             'government services': 1,
             'healthcare': 2,
             'hospitality technology': 2,
             'justice': 1,
             'manufacturing': 1,
             'marine biology': 3,
             'maritime': 1,
             'media': 2,
             'mining operations': 1,
             'nonprofit operations': 1,
             'oceanography': 1,
             'oceans': 1,
             'oil and gas': 2,
             'philanthropy': 2,
             'public health': 2,
             'public safety': 1,
             'public transportation': 2,
             'rare earth elements': 1,
             'real estate': 3,
             'restaurant operations': 2,
             'retail': 1,
             'rural development': 1,
             'rural health': 1,
             'space': 3,
             'space exploration': 1,
             'sports entertainment': 2,
             'startups': 1,
             'sustainable infrastructure': 2,
             'telecommunications': 1,
             'tourism': 1,
             'transportation': 1,
             'venture capital': 1,
             'waste management': 1,
             'water resources': 1,
             'wildlife conservation': 3},
  'domain_description': {'Agricultural innovation metrics, rural infrastructure projects, community development initiatives, and economic diversification efforts.': 1,
                         'Animal population data, habitat preservation efforts, and community education programs.': 3,
                         'Aquatic farming data, fish stock management, ocean health metrics, and sustainable seafood trends.': 1,
                         'Audience demographics, viewership trends, content ratings, production budgets, and marketing strategies for movies, TV shows, and music.': 1,
                         'Building permit data, construction labor statistics, project timeline information, and sustainable building practices.': 3,
                         'Chemical manufacturing data, safety protocols, environmental impact assessments, and product innovation metrics.': 2,
                         'Community health statistics, infectious disease tracking data, healthcare access metrics, and public health policy analysis.': 2,
                         'Company founding data, funding records, diversity metrics, and innovation trends.': 1,
                         'Company founding data, investment rounds, exit strategies, and diversity metrics in the startup ecosystem.': 1,
                         'Comprehensive data on agroecology, food justice, indigenous food systems, and urban agriculture.': 1,
                         'Comprehensive data on disability accommodations, support programs, policy advocacy, and inclusion efforts in disability services.': 1,
                         'Comprehensive data on marine species, oceanography, conservation efforts, and climate change impacts in marine biology.': 3,
                         'Comprehensive data on sustainable forest management, timber production, wildlife habitat, and carbon sequestration in forestry.': 2,
                         'Cosmetics sales data, beauty product ingredient transparency, consumer preferences, and sustainability metrics.': 1,
                         'Crime statistics, emergency response times, community policing metrics, and disaster preparedness data.': 1,
                         'Data on art collections, cultural event attendance, artist demographics, museum operations, and heritage preservation efforts.': 1,
                         'Defense contract data, military equipment maintenance, threat intelligence metrics, and veteran employment stats.': 3,
                         'Defense data on military innovation, peacekeeping operations, defense diplomacy, and humanitarian assistance.': 4,
                         'Detailed financial data including investment strategies, risk management, fraud detection, customer analytics, and regulatory compliance.': 1,
                         'Detailed records on ethical manufacturing, circular economy, workforce development, and industry 4.0.': 1,
                         'Detailed records on healthcare access, disease prevalence, and resource allocation in rural health.': 1,
                         'Detailed records on military technology, intelligence operations, national security, and cybersecurity strategies.': 3,
                         'Donation records, program outcomes, volunteer engagement metrics, budget reports, and community impact assessments.': 1,
                         'Energy market data covering renewable energy sources, energy storage, carbon pricing, and energy efficiency.': 2,
                         'Exploration data, production figures, infrastructure development, and market trends.': 2,
                         'Extensive data on route planning, fare collection, vehicle maintenance, and accessibility in public transportation.': 2,
                         'Extensive data on sustainable materials, fair labor practices, circular economy, and consumer awareness in ethical fashion.': 2,
                         'Financial data on Shariah-compliant finance, socially responsible lending, financial capability, and financial wellbeing.': 1,
                         'Food safety records, nutrition data, supply chain transparency, and sustainable food trends.': 2,
                         'Genetic research data, bioprocess engineering information, biotech startup funding, and biosensor technology development.': 2,
                         'Government data on open data initiatives, public participation, evidence-based policy making, and government transparency.': 1,
                         'Green building data, renewable energy infrastructure projects, carbon offset initiatives, and smart city technology adoption.': 2,
                         'Healthcare data on mental health parity, cultural competency, health equity metrics, and community health workers.': 2,
                         'Hotel tech adoption metrics, online travel agency data, virtual tour engagement stats, and hospitality AI trends.': 2,
                         'In-depth data on art history, curation, exhibition, and cultural impact in the fine arts.': 1,
                         'Infrastructure development data, engineering design standards, public works project information, and resilience metrics.': 1,
                         'International visitor statistics, travel advisory information, destination marketing data, and sustainable tourism practices.': 1,
                         'Justice data on restorative justice, access to justice, criminal justice reform, and legal technology.': 1,
                         'Marine life research data, ocean floor mapping projects, pollution control initiatives, and maritime law compliance.': 1,
                         'Media data on content diversity, media literacy, disinformation detection, and media representation.': 2,
                         'Military equipment sales data, defense project timelines, contract negotiations, and geopolitical risk assessments.': 1,
                         'Mining operation data, environmental impact stats, workforce diversity, and resource depletion metrics.': 1,
                         'Mobile and broadband subscriber data, network infrastructure investments, customer usage patterns, and regulatory compliance information.': 1,
                         'Ocean data on marine conservation, ocean acidification, deep-sea exploration, and maritime safety.': 1,
                         'Philanthropy data on effective altruism, impact investing, philanthropic trends, and donor demographics.': 2,
                         'Player demographics, game design data, esports event information, and virtual reality technology adoption.': 1,
                         'Public service delivery, budget allocation, citizen feedback, and policy impact.': 1,
                         'Rare earth element production data, market trends, environmental impact stats, and supply chain transparency.': 1,
                         'Real estate data on inclusive housing policies, sustainable urbanism, property co-ownership, and housing affordability.': 3,
                         'Restaurant revenue data, menu engineering information, food safety inspection records, and sustainable sourcing practices.': 2,
                         'Retail data on circular supply chains, ethical labor practices, product transparency, and consumer education.': 1,
                         'Space data on space exploration, satellite technology, space debris mitigation, and astrobiology.': 3,
                         'Spacecraft manufacturing data, space mission records, astronaut medical data, and astrophysics research.': 1,
                         'Sports team performance data, fan demographics, ticket sales statistics, and athlete wellbeing programs.': 2,
                         'Threat intelligence data, vulnerability assessments, security incident response metrics, and cybersecurity policy analysis.': 3,
                         'Transportation data on electric vehicle adoption, autonomous vehicles, public transportation systems, and multimodal mobility.': 1,
                         'Vehicle safety testing results, autonomous driving research data, electric vehicle adoption statistics, and auto show information.': 6,
                         'Vessel performance data, cargo tracking, safety records, and regulatory compliance.': 1,
                         'Waste generation metrics, recycling rates, landfill capacity data, and circular economy initiatives.': 1,
                         'Water usage metrics, drought impact assessments, wastewater treatment data, and water conservation initiatives.': 1},
  'sql': {'DELETE FROM Program_Outcomes WHERE program_id = 1002;': 1,
          "DELETE FROM humanitarian_assistance WHERE country_id = (SELECT id FROM country WHERE name = 'Kenya') AND year = 2018;": 1,
          'DROP TABLE vehicle_safety_testing;': 1,
          "INSERT INTO Legislation (ID, Description, Status) VALUES (4, 'Climate Change Act', 'Draft');": 1,
          "INSERT INTO PolicyImpact (ID, Policy, Impact, StartDate, EndDate) VALUES (3001, 'Body Cameras for Police Officers', 'Reduction in use-of-force incidents by 25%', '2021-01-01', '2022-12-31');": 1,
          'SELECT (COUNT(*) * 100.0 / (SELECT COUNT(*) FROM products)) as percentage FROM products WHERE is_recycled = TRUE;': 1,
          "SELECT * FROM defense_diplomacy WHERE participant_country IN ('China', 'India');": 1,
          "SELECT AVG(Age) FROM Players JOIN VRUsers ON Players.PlayerID = VRUsers.PlayerID WHERE Country = 'France';": 1,
          "SELECT AVG(I.InspectionScore) as AvgInspectionScore FROM Restaurants R INNER JOIN Inspections I ON R.RestaurantID = I.RestaurantID WHERE R.Region = 'Westwood';": 1,
          "SELECT AVG(Property_Size) FROM Inclusive_Housing WHERE Inclusive = 'Yes';": 1,
          'SELECT AVG(avg_depth) FROM marine_protected_areas;': 1,
          'SELECT AVG(fare) FROM red_line WHERE route_id = 102 AND EXTRACT(DAY FROM date) BETWEEN 2 AND 6 AND EXTRACT(MONTH FROM date) = 2;': 1,
          'SELECT AVG(hourlyRate * hoursWorked * 5) AS AverageLaborCost FROM LaborStatistics;': 1,
          "SELECT AVG(production_budget) FROM movies WHERE genre IN ('Action', 'Drama') AND release_year BETWEEN 2000 AND 2010;": 1,
          "SELECT AVG(response_time) FROM boston_emergency_response WHERE incident_type = 'Fire';": 1,
          "SELECT AVG(speed) FROM vehicle_speed WHERE type = 'electric' AND city IN ('New York', 'London');": 1,
          "SELECT AVG(stars) FROM hotel_ratings WHERE country IN ('Japan', 'South Korea');": 1,
          "SELECT AVG(temperature) FROM (SELECT temperature FROM Ocean WHERE region = 'Pacific' GROUP BY temperature, YEAR(STR_TO_DATE(region, '%Y'))) AS PacificAverage;": 1,
          "SELECT COUNT(*) FROM companies WHERE city='San Francisco' AND state='CA' AND founder_gender='female';": 1,
          "SELECT COUNT(*) FROM factories WHERE sector = 'renewable energy' HAVING employee_count > 50;": 1,
          "SELECT COUNT(*) FROM maintenance_requests WHERE date BETWEEN '2020-01-01' AND '2020-01-31' AND type = 'equipment';": 1,
          "SELECT COUNT(*) FROM marine_species WHERE location = 'Southern Ocean';": 1,
          "SELECT COUNT(*) FROM properties WHERE city = 'New York' AND listing_price > 800000 AND wheelchair_accessible = true;": 1,
          "SELECT COUNT(*) FROM recalls WHERE product LIKE 'Organic Chicken%' AND date BETWEEN '2020-01-01' AND '2022-12-31';": 1,
          "SELECT COUNT(*) FROM space_missions WHERE leader IN (SELECT name FROM astronauts WHERE gender = 'Female');": 1,
          'SELECT COUNT(*) FROM sports_events WHERE year = 2019 AND tickets_sold > 50000;': 1,
          "SELECT COUNT(DISTINCT species) FROM trees JOIN biomes ON trees.biome_id = biomes.biome_id WHERE trees.dbh > 50.0 AND biomes.name = 'Temperate Rainforest';": 1,
          'SELECT COUNT(DISTINCT user_id) FROM user_activity WHERE EXTRACT(MONTH FROM activity_date) = 1;': 1,
          "SELECT CoOwners.CoOwnerID, Properties.City FROM CoOwners INNER JOIN Properties ON CoOwners.PropertyID = Properties.PropertyID WHERE Properties.City = 'New York City' AND Properties.Accessibility = 'No';": 1,
          "SELECT Country, COUNT(*) as Total_Papers FROM ResearchPapers WHERE PublishedDate >= DATE_SUB(CURRENT_DATE, INTERVAL 1 YEAR) AND Author LIKE '%autonomous%' GROUP BY Country;": 1,
          'SELECT CulturalCompetencyTraining.TrainingID, CulturalCompetencyTraining.MHW_ID, CulturalCompetencyTraining.TrainingName, CulturalCompetencyTraining.TrainingDate, CommunityHealthWorker.Name FROM CulturalCompetencyTraining INNER JOIN CommunityHealthWorker ON CulturalCompetencyTraining.MHW_ID = CommunityHealthWorker.WorkerID;': 1,
          "SELECT DISTINCT REE FROM production WHERE country = 'Australia' AND year = 2020;": 1,
          "SELECT MAX(capacity) FROM Production WHERE location = 'Eastern';": 1,
          "SELECT MIN(energy_production) FROM wind_turbines WHERE installation_year > 2016 AND country = 'China';": 1,
          "SELECT MIN(serving_size) FROM MealTypes WHERE meal_type = 'Gluten-free' AND store_type = 'Convenience Store';": 1,
          'SELECT Model FROM VehicleModels WHERE SafetyRating > 4.5;': 1,
          "SELECT Program, Budget FROM Programs WHERE Type = 'Mobility';": 1,
          'SELECT Region, SUM(AmountDonated) as TotalDonated FROM Donors GROUP BY Region;': 1,
          "SELECT SUM(Amount) AS TotalAssistance, Country FROM HumanitarianAssistance WHERE Organization NOT IN ('Government', 'Military') AND Year BETWEEN 2016 AND 2020 GROUP BY Country;": 1,
          'SELECT SUM(DonationAmount) FROM Donors WHERE Age >= 40;': 1,
          "SELECT SUM(Personnel) FROM MilitaryCyberOps WHERE Region = 'Asia';": 1,
          "SELECT SUM(animal_populations.population) FROM conservation_programs INNER JOIN animal_populations ON conservation_programs.id = animal_populations.program_id WHERE conservation_programs.location = 'USA' OR conservation_programs.location = 'Canada';": 1,
          "SELECT SUM(data_usage) FROM mobile_usage WHERE city = 'Toronto' AND year = 2022;": 1,
          "SELECT SUM(fare) FROM bus_routes WHERE route_name = 'Green Line';": 1,
          "SELECT SUM(fr.funding_amount) FROM companies c INNER JOIN funding_rounds fr ON c.company_id = fr.company_id WHERE c.founder_gender = 'Female';": 1,
          "SELECT SUM(num_vehicles) FROM electric_vehicles WHERE country IN ('China', 'Japan');": 1,
          'SELECT SUM(personnel) FROM us_military_personnel WHERE year IN (2018, 2019, 2020);': 1,
          "SELECT SUM(quantity) FROM cotton_source WHERE country = 'USA' AND brand IN (SELECT brand FROM fair_labor WHERE commitment = 'yes');": 1,
          'SELECT SUM(revenue) FROM BrandRevenue WHERE circular_model = TRUE AND year = 2020;': 1,
          'SELECT SUM(spending) FROM defense.eu_humanitarian_assistance WHERE year BETWEEN 2019 AND 2021;': 1,
          "SELECT SUM(value) FROM socially_responsible_loans WHERE client_gender = 'female' AND date BETWEEN '2021-07-01' AND '2021-12-31';": 1,
          "SELECT SUM(water_consumption) FROM industrial_customers WHERE location IN ('Texas', 'Oklahoma');": 1,
          'SELECT SpeciesName, AVG(WaterTemp) as AvgTemp FROM SpeciesWaterTemp INNER JOIN FishSpecies ON SpeciesWaterTemp.SpeciesID = FishSpecies.SpeciesID WHERE MONTH(Date) = 2 GROUP BY SpeciesName;': 1,
          'SELECT State, COUNT(*) FROM Hospitals GROUP BY State;': 1,
          'SELECT Suppliers.* FROM Suppliers LEFT JOIN (SELECT supplier_id FROM Raw_Materials WHERE supply_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH) GROUP BY supplier_id) AS RM ON Suppliers.supplier_id = RM.supplier_id WHERE RM.supplier_id IS NULL;': 1,
          "SELECT SustainablePractices.PracticeName FROM SustainablePractices WHERE SustainablePractices.Department = 'Structural Engineering' AND SustainablePractices.Cost > 10000.00;": 1,
          'SELECT YEAR(start_date) AS year, MAX(COUNT(*)) AS projects_count FROM genetic.projects GROUP BY year;': 1,
          'SELECT YEAR(start_date) AS year, MONTH(start_date) AS month, COUNT(*) AS projects FROM project_timeline WHERE end_date IS NOT NULL GROUP BY year, month;': 1,
          'SELECT a.name, COUNT(*) as artworks_count FROM Artists a JOIN Artworks aw ON a.id = aw.artist_id GROUP BY a.name ORDER BY artworks_count DESC LIMIT 10;': 1,
          'SELECT a.name, SUM(av.valuation) AS total_valuation FROM artist a JOIN artists_valuation av ON a.id = av.artist_id GROUP BY a.id, a.name;': 1,
          "SELECT a.name, h.name FROM Animals a INNER JOIN AnimalEducation ae ON a.id = ae.animal_id INNER JOIN EducationPrograms e ON ae.program_id = e.id INNER JOIN Coordinators c ON e.coordinator_id = c.id INNER JOIN Habitat h ON a.habitat_id = h.id WHERE c.region = 'Americas';": 1,
          'SELECT animal_group, conservation_status, year, COUNT(*) FROM combined GROUP BY animal_group, conservation_status, year;': 1,
          "SELECT base_name, base_type FROM Armed_Forces WHERE base_location = 'California';": 1,
          'SELECT category, start_year, COUNT(*), SUM(budget) FROM economic_diversification WHERE start_year >= 2019 GROUP BY category, start_year;': 1,
          'SELECT country, SUM(amount) as total_textile_waste FROM textile_waste WHERE year = 2021 GROUP BY country;': 1,
          'SELECT country_of_origin, MAX(avg_distance) FROM satellites GROUP BY country_of_origin;': 1,
          'SELECT d.name, AVG(f.income) FROM farmers_india f JOIN districts_india d ON f.district_id = d.id GROUP BY d.name;': 1,
          'SELECT equipment_type, SUM(maintenance_frequency) AS total_maintenance_frequency FROM equipment_maintenance GROUP BY equipment_type;': 1,
          'SELECT f.field_id, f.field_name, fp.production_rate FROM fields f LEFT JOIN fields_production fp ON f.field_id = fp.field_id;': 1,
          "SELECT hotel_name, q1_2022_views FROM virtual_tour_stats WHERE region = 'APAC' ORDER BY q1_2022_views DESC LIMIT 5;": 1,

In [24]:

results_4 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).num_words_per_record()
pprint(results_4)

{'average_words_per_record': 12.88,
 'word_counts_per_column': {'domain': 1.63,
                            'domain_description': 13.3,
                            'sql': 14.83,
                            'sql_complexity': 1.71,
                            'sql_complexity_description': 8.01,
                            'sql_context': 31.05,
                            'sql_explanation': 35.5,
                            'sql_prompt': 13.88,
                            'sql_task_type': 2.93,
                            'sql_task_type_description': 5.96}}

## Testing SQL Validation

In [4]:
sql_linter_results = pd.read_csv("/mnt/foundation-shared/nina_xu_gretel_ai/datasets/sqlqueries_1200_validated_092524.csv")

In [ ]:
# Coalesce the results of the five dialects into a single column
sql_linter_results['is_valid_sql'] = sql_linter_results['is_valid_sqlite'].fillna(
    sql_linter_results['is_valid_mysql'].fillna(
        sql_linter_results['is_valid_postgresql'].fillna(
            sql_linter_results['is_valid_sqlserver'].fillna(
                sql_linter_results['is_valid_googlesql']
            )
        )
    )
)

sql_linter_results['error_msg'] = sql_linter_results['error_msg_sqlite'].fillna(
    sql_linter_results['error_msg_mysql'].fillna(
        sql_linter_results['error_msg_postgresql'].fillna(
            sql_linter_results['error_msg_sqlserver'].fillna(
                sql_linter_results['error_msg_googlesql']
            )
        )
    )
)

print(sql_linter_results.is_valid_sql.value_counts())
def is_type_error(error_msg):
    # These errors are because of misuse of data types, and they are dialect-specific
    # Because the prompt as of now is not aware of the dialect, it makes sense if the LLM cannot identify these errors
    import re
    error_msg = str(error_msg).lower()

    pattern = r'type "\w+" does not exis'
    # Check if the pattern exists in the string
    if re.search(pattern, error_msg):
        return True
    
    patterns = ["type not found", "cannot find data type", "error creating tables", "'CREATE VIEW' must be the first statement in a query batch",
                "login failed"]
    for pattern in patterns:
        if pattern.lower() in error_msg:
            return True

    return False
sql_linter_results['is_type_error'] = sql_linter_results.error_msg.apply(is_type_error)
p = sql_linter_results[sql_linter_results.is_valid_sql == True].sample(10)
n = sql_linter_results[(sql_linter_results.is_valid_sql == False) & (sql_linter_results.is_type_error == False)]#.sample(10)

sql_linter_results_10 = pd.concat([p, n])
sql_linter_results_10.shape

In [ ]:
task_5 = NL2SQLEvaluationTaskSuite(
    llm_suite=llm_suite, dataset=sql_linter_results_10, code_lang="sql"
    )
results_5 = task_5.llm_as_a_critic_evaluation(
    instruction_col_name="Natural Language Prompt", code_col_name="SQL Query", context_col_name="Context"
)
table5 = task_5.output_dataset

# task_6 = BaseEvaluationTaskSuite(llm_suite, dataset_10_pd)
# results_6 = task_6.llm_as_a_critic_evaluation(
#     instruction_col_name="sql_prompt", code_col_name="sql"
# )

In [33]:

print(results_5)
# print(results_6)

# review specific records
# print(dataset_10_pd.loc[results_1['non_semantically_unique_ids']])

{'llm_as_a_critic_score': 3.5764705882352943}

In [34]:
table5['correctness_score'] = table5['scores'].apply(lambda x: x['correctness_score'])

In [35]:
table5[['Natural Language Prompt', 'SQL Query', 'Context', 'Dialect', 'is_valid_sql', 'scores', 'overall_score', 'correctness_score']]

,Natural Language Prompt,SQL Query,Context,Dialect,is_valid_sql,scores,overall_score,correctness_score
927,List all patients who have been admitted to th...,SELECT p.name FROM Patients p JOIN ( SELEC...,CREATE TABLE Patients ( patient_id VARCHAR...,MySQL,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
52,What is the average latency for each node in t...,"SELECT node_name, AVG(latency) AS avg_latency ...",CREATE TABLE network_nodes (node_id SERIAL PRI...,PostgreSQL,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
159,Find the names of patients who have had teleme...,SELECT p.Name FROM Patients p JOIN Consultatio...,CREATE TABLE Patients (PatientID INTEGER PRIMA...,SQLite,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
715,What is the average broadband speed for each c...,"SELECT City, AVG(Speed) AS AverageSpeed FROM B...","CREATE TABLE BroadbandData (City VARCHAR(50), ...",SQL Server,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
827,What is the total number of defective products...,SELECT COUNT(*) AS TotalDefective FROM Defects...,CREATE TABLE Products (ProductID INT PRIMARY K...,SQL Server,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1131,What is the average market value of homes owne...,SELECT AVG(MarketValue) as AvgMarketValue FROM...,"CREATE TABLE Owners ( OwnerID STRING, ...",GoogleSQL,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
394,Show me the average rating given by customers ...,"SELECT p.name, AVG(r.rating) AS average_rating...","CREATE TABLE products (id SERIAL PRIMARY KEY, ...",PostgreSQL,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
621,How many customer service tickets were resolve...,SELECT COUNT(*) AS ResolvedTickets FROM Custom...,CREATE TABLE CustomerServiceTickets (TicketID ...,SQL Server,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
954,How many items were sold in each category last...,"SELECT c.name AS category_name, SUM(s.quantity...","CREATE TABLE sales (id SERIAL PRIMARY KEY, ite...",PostgreSQL,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
502,Show me the list of products in the shopping c...,"SELECT p.product_name, p.price FROM products p...","CREATE TABLE users (user_id INT PRIMARY KEY, u...",MySQL,True,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.4,4
51,Show me all reviews made by customers who purc...,SELECT r.review_text FROM reviews r JOIN order...,CREATE TABLE customers ( customer_id VARCH...,SQL Server,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.4,4
77,Show me the list of tenants who have rented pr...,"SELECT tenant_name, COUNT(*), tenant_id FROM t...",CREATE TABLE properties ( property_id INT PR...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
144,List all ongoing clinical trials for breast ca...,SELECT Name FROM ClinicalTrials WHERE Conditio...,CREATE TABLE ClinicalTrials ( TrialID INT ...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
155,What are the total sales of each drug for the ...,"SELECT d.name, SUM(s.quantity_sold) as total_s...","CREATE TABLE sales (id SERIAL PRIMARY KEY, dru...",PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
168,What is the average signal strength measured i...,SELECT AVG(SignalStrength) AS AverageSignalStr...,CREATE TABLE Signals ( SignalID INT AUTO_I...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
169,Show me the average time students spend on ass...,"SELECT course_id, AVG(hours_spent) AS average_...",CREATE TABLE students ( student_id VARCHAR2(...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
186,Retrieve the list of devices that support 5G t...,SELECT device_name FROM Devices WHERE supports...,CREATE TABLE Devices ( device_id SERIAL PR...,PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
212,What is the average age of patients who were a...,SELECT AVG(age) FROM patients JOIN admissions ...,CREATE TABLE patients (patient_id INTEGER PRIM...,SQLite,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
247,Show the total sales amount for each product c...,"SELECT c.category_name, SUM(s.quantity * p.pri...","CREATE TABLE sales (id INTEGER PRIMARY KEY, pr...",SQLite,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
261,List all patients who have scheduled an appoin...,SELECT P.name FROM Patients P JOIN Appointment...,CREATE TABLE Patients (patient_id SERIAL PRIMA...,PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
308,Retrieve the names and IP addresses of all act...,"SELECT server_name, ip_address FROM servers WH...",CREATE TABLE servers ( server_id INT PRIMA...,SQL Server,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
398,List all ongoing clinical trials related to Ty...,"SELECT trial_id, trial_name, start_date, end_d...",CREATE TABLE clinical_trials ( trial_id VARC...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
409,Show me the number of active 5G users in each ...,"SELECT City, COUNT(UserID) AS ActiveUsers FROM...","CREATE TABLE 5GUsers (UserID VARCHAR(255), Use...",PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
469,"How many stores have reported sales over $50,0...",SELECT COUNT(DISTINCT StoreID) AS NumberOfStor...,CREATE TABLE StoreSales ( StoreID VARCHAR(...,SQL Server,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
528,List all students and their assigned groups in...,"SELECT Students.StudentName, Groups.GroupName ...",CREATE TABLE Students ( StudentID INT PRIM...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.4,4
555,Show me the total number of 5G base stations d...,"SELECT city, COUNT(*) AS total_base_stations F...",CREATE TABLE base_stations (station_id SERIAL ...,PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
605,List the names and starting dates of all activ...,"SELECT name, start_date FROM ClinicalTrials WH...",CREATE TABLE ClinicalTrials ( trial_id INT...,SQLite,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
625,List all items in the shopping cart of user wi...,"['SELECT p.ProductName, p.Price, sci.Quantity'...","['CREATE TABLE Users (', ' UserID INT PRIMA...",SQL Server,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
627,How many 5G towers are there in New York City?,SELECT COUNT(*) FROM Towers WHERE city = 'New ...,"CREATE TABLE Towers (id SERIAL PRIMARY KEY, ci...",PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
645,What are the details of prescriptions made by ...,"SELECT p.PrescriptionID, pa.Name AS PatientNam...",CREATE TABLE Doctors (DoctorID VARCHAR PRIMARY...,PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
719,Show all clinical trials related to diabetes t...,SELECT * FROM Clinical_Trials WHERE condition ...,CREATE TABLE Clinical_Trials (ID VARCHAR(255) ...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
722,List all patients diagnosed with hypertension ...,SELECT Name FROM Patients WHERE Condition = 'h...,CREATE TABLE Patients (PatientID INT PRIMARY K...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
726,Show the total number of telemedicine appointm...,"SELECT Doctors.name, COUNT(Appointments.appoin...",CREATE TABLE Doctors ( doctor_id INT PRIMA...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
775,Show the total sales for each payment method.,"SELECT payment_method, SUM(amount) AS total_sa...",CREATE TABLE Payments ( payment_id VARCHAR2(...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
783,List the names and emails of all students who ...,"SELECT s.Name, s.Email FROM Students s JOIN En...",CREATE TABLE Students ( StudentID INT PRIM...,SQL Server,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
846,What are the names and capacities of all 5G ba...,"SELECT name, capacity FROM base_stations WHERE...",CREATE TABLE base_stations (id SERIAL PRIMARY ...,PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
851,Show me the top 5 products by sales revenue in...,"SELECT p.product_name, SUM(s.revenue) as total...",CREATE TABLE sales ( sale_id INT AUTO_INCR...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
869,List all ongoing clinical trials for Alzheimer...,SELECT * FROM Clinical_Trials WHERE disease = ...,CREATE TABLE Clinical_Trials (trial_id SERIAL ...,PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
890,List all products that are currently out of st...,SELECT product_name FROM Inventory WHERE quant...,CREATE TABLE Inventory (product_id VARCHAR2(20...,PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
893,List the names and grades of students who scor...,"SELECT s.name, t.grade FROM students s JOIN te...",CREATE TABLE students (student_id INT PRIMARY ...,MySQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
902,List the patient IDs and their respective MRI ...,"SELECT patients.patient_id, mri_scans.findings...","CREATE TABLE patients (patient_id VARCHAR(20),...",PostgreSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1011,Retrieve the total number of likes each post\n...,"SELECT p.post_id, COUNT(l.like_id) as total_li...","CREATE TABLE Posts ( post_id STRING, user_...",GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1014,List the average speed of each vehicle type ov...,"SELECT vehicle_type, AVG(speed) AS average_spe...",CREATE TABLE vehicle_data ( vehicle_id STRIN...,GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1054,Find the total number of returning customers i...,SELECT COUNT(DISTINCT c.customer_id) AS return...,"CREATE TABLE Customers (customer_id STRING, fi...",GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1085,List the top 5 products by sales for each region?,"SELECT region, product_id, RANK() OVER (PARTIT...","CREATE TABLE sales_data ( product_id STRING,...",GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.2,3
1101,List the names and contact details of all staf...,"SELECT Name, ContactDetails FROM FrontDeskStaf...",CREATE TABLE Staff ( StaffID STRING NOT NU...,GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.4,4
1114,Show me the top 5 most shared blog posts on so...,"SELECT bp.title, SUM(sm.shares) AS total_share...","CREATE TABLE blog_posts ( post_id STRING, ...",GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1116,What is the average number of likes per post o...,SELECT AVG(Likes) as AvgLikes FROM Posts WHERE...,"CREATE TABLE Posts (PostID STRING, UserID STRI...",GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1124,What is the percentage of returning customers ...,SELECT ROUND( (COUNT(DISTINCT c.customer_id) *...,CREATE TABLE customers ( customer_id STRIN...,GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1149,List all batches that have a defect rate highe...,SELECT batch_id FROM batch_defects WHERE defec...,"CREATE TABLE batches ( batch_id STRING, to...",GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4
1172,Show the total sales for each channel in the l...,"SELECT s.channel, SUM(s.amount) AS tot...",CREATE TABLE sales ( sale_id STRING NOT NU...,GoogleSQL,False,"{'relevance_score': 4, 'relevance_reason': 'Th...",3.6,4

In [36]:
# calculate the average correctness scores grouped by is_valid_sql
table5.groupby('is_valid_sql')['correctness_score'].mean()

is_valid_sql
False    3.97561
True     4.00000
Name: correctness_score, dtype: float64

In [38]:
table5.to_csv("/mnt/foundation-shared/nina_xu_gretel_ai/datasets/sql_linter_results_35.csv", index=False)

In [52]:
count = 0

In [95]:
indices = table5[table5.is_valid_sql == False].index
ind = indices[count]
print(f'ind = {ind}')
print('\n', table5['error_msg'].loc[ind])
print('\n', table5['Natural Language Prompt'].loc[ind])
print('\n', table5['Context'].loc[ind])
print('\n', table5['SQL Query'].loc[ind])
print('\n', table5['scores'].loc[ind])

count += 1

IndexError: index 41 is out of bounds for axis 0 with size 41

In [54]:
print(indices)

Index([  51,   77,  144,  155,  168,  169,  186,  212,  247,  261,  308,  398,
        409,  469,  528,  555,  605,  625,  627,  645,  719,  722,  726,  775,
        783,  846,  851,  869,  890,  893,  902, 1011, 1014, 1054, 1085, 1101,
       1114, 1116, 1124, 1149, 1172],
      dtype='int64')

In [39]:
# ind = 851
# ind = 893
# ind = 169
# print(table5['error_msg_mysql'].loc[ind])

# ind = 247
# ind = 212
# print(table5['error_msg_sqlite'].loc[ind])

# ind = 499
# ind = 1085
# ind = 1011
# print(table5['error_msg_googlesql'].loc[ind]) # Type not found

# ind = 876
# ind = 928
# ind = 985
# ind = 813
# ind = 885
# ind = 308
ind = 51
print(table5['error_msg_sqlserver'].loc[ind]) # Cannot find data type NUMBER

# ind = 298
# ind = 846
# print(table5['error_msg_postgresql'].loc[ind]) # type "number" does not exist


print('\n', table5['Natural Language Prompt'].loc[ind])
print('\n', table5['Context'].loc[ind])
print('\n', table5['SQL Query'].loc[ind])
print('\n', table5['scores'].loc[ind])

(pyodbc.ProgrammingError) ('42000', "[42000] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]'ADD_MONTHS' is not a recognized built-in function name. (195) (SQLExecDirectW)")
[SQL: SELECT r.review_text FROM reviews r JOIN orders o ON r.customer_id = o.customer_id JOIN products p ON o.product_id = p.product_id WHERE p.category = 'Electronics' AND o.purchase_date >= ADD_MONTHS(SYSDATE, -1);]
(Background on this error at: http://sqlalche.me/e/f405)

 Show me all reviews made by customers who purchased electronics in the last month.

 CREATE TABLE customers (     customer_id VARCHAR(255) PRIMARY KEY,     name VARCHAR(255),     email VARCHAR(255) );  CREATE TABLE orders (     order_id VARCHAR(255) PRIMARY KEY,     customer_id VARCHAR(255),     purchase_date DATE,     product_id VARCHAR(255),     FOREIGN KEY (customer_id) REFERENCES customers(customer_id) );  CREATE TABLE products (     product_id VARCHAR(255) PRIMARY KEY,     product_name VARCHAR(255),     category VARCHAR(255) );  CREATE TABLE reviews (     review_id VARCHAR(255) PRIMARY KEY,     customer_id VARCHAR(255),     product_id VARCHAR(255),     review_text TEXT,     review_date DATE,     FOREIGN KEY (customer_id) REFERENCES customers(customer_id),     FOREIGN KEY (product_id) REFERENCES products(product_id) );

 SELECT r.review_text FROM reviews r JOIN orders o ON r.customer_id = o.customer_id JOIN products p ON o.product_id = p.product_id WHERE p.category = 'Electronics' AND o.purchase_date >= ADD_MONTHS(SYSDATE, -1);

 {'relevance_score': 4, 'relevance_reason': 'The query accurately retrieves reviews from customers who purchased electronics in the last month.', 'correctness_score': 4, 'correctness_reason': 'The query executes flawlessly, returning accurate and complete results.', 'readability_score': 3, 'readability_reason': 'The code is well-formatted and uses aliases, but lacks comments.', 'scalability_score': 3, 'scalability_reason': 'The query scales well, but could be optimized by using EXPLAIN PLAN to check for potential performance issues.', 'standards_score': 3, 'standards_reason': 'The query closely follows SQL standards, but could benefit from using standard date functions instead of vendor-specific ones.'}

In [ ]:
print(table5['scores'].loc[0])

In [ ]:
table6 = task_6.output_dataset
print(table6['scores'].loc[0])